app/controllers/articles_controller.rb

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "tumblr_inline_n0aleph3Fl1r8rr6o.png"], ["image_content_type", "image/png"], ["image_file_size", 132699], ["updated_at", 2016-09-09 14:54:08 UTC], ["id", 7]]

	def destroy
		Article.find(params[:id]).destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

	def remove_image
		@article = Article.find(params[:id])
		@article.image.destroy
		@article.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", nil], ["image_content_type", nil], ["image_file_size", nil], ["updated_at", 2016-09-10 10:03:13 UTC], ["id", 7]]